Measure_samples.org
**** DONE UI command
  Now the command to be executed has only a few possible values, which are used to, as previously explained, to terminate the program, or execute one of the routines.
  #+BEGIN_SRC python
    ############################################################
    ## @class  CMD
    #  @brief  UI calss to encode the possible commands for the
    #         program
    ############################################################
    class UI_CMD:
        EXIT    = 0
        M_BREAK = 1
        MEASURE = 2
  #+END_SRC 

**** TODO UI Configuration Parameters
The UI configuration is a list of variables which are used through the measurements for configuring the experiments or for controlling the presentation of the results, for simplicity the variables are classified in groups
- Basic parameters :: These are the parameters that control the run and define it see [[UI - Basic parameters ]]
- Advanced parameters :: There are more advanced parameters that influence the run, but have minor impact (usually) when compared with the other parameters, and the user is rarely ever expected to modify them. See [[UI - Advanced parameters]]
- Presentation parameters :: The results of the experiment is processed in graph; some of the parameters for the graph can be tweaked to improve the readability of them. See [[UI - Presentation]]

#+BEGIN_SRC python
  ############################################################
  ## @class   UI_CONFIG
  #  @details This class stores all configuration values to be
  #           used for the measurements.
  ############################################################
  class UI_CONFIG_PARAMS:
      def __init__(self):
          self._b_params = basic_params()
          self._a_params = adv_params()
          self._p_params = presentation()

      <<ui-config-bp-interface>>
      <<ui-config-ap-interface>>
      <<ui-config-pp-interface>>
#+END_SRC


Finally the interface with the rest of the program is defined through a single method

#+BEGIN_SRC python
  def ui_get_gui_config():
      retval = run_gui()
      return retval
#+END_SRC

Before describing each parameter group, is clear that most parameters are numerical, therefore it makes sense to define a class which encapsulates the common functionality for the numerical parameters. This class is defined in [[Numerical Parameters definition]]

***** DONE Numerical Parameters definition
As previously stated most parameters are numerical, so a parent class is created to provide a common interface for them all and to ensure that all numerical parameters behave consistently.
The numerical parameters are defined in [[src-config-num-param-class]], which provides the interfaces that define the numerical parameters
- Initialization function :: The function defined in line [[(src-np-init)]], provide the initialization code for a generic numerical parameter, which is defined by the following parameters:
  - Default Value :: Is the value that the parameter takes by default, such as the voltage for the juncture.
  - Minimum value :: The minimum value acceptable for the parameter. With the maximum value defines the range of admissible values
  - Maximum value :: The maximum value acceptable for the parameter. With the minimum value defines the range of admissible values
  - Name :: The name defines a name for the parameter, which is useful to print information about it. 
- Reset function :: Defined in line  [[(src-np-reset)]], provides a mechanism to restore the parameter value to its default.
- Validation function ::  Defined in line [[(src-np-validation)]] returns a boolean determining if the new value is within the range of accepted values
- Update function :: Defined in line  [[(src-np-update)]] updates the juncture voltage to a new value defined by the user, only if the value is within the accepted range, but if not it leaves the value unchanged
- Print function ::  Defined in line  [[(src-np-print)]] provides an utility to print the current value to the terminal. Useful during testing and for sending messages


#+CAPTION: Numerical parameters class definition
#+NAME: src-config-num-param-class
#+BEGIN_SRC python  -n -r
  #############################################################
  ## @class   Numerical Parameter
  #  @brief   All functionality related to the numerical
  #           parameters
  #
  #  @details This class defines the basic behavior common to
  #           all numerical parameters, including common
  #           interfaces and values.
  #############################################################
  class numerical_parameter(object):
      #############################################################
      ## @brief   Initilaization code
      #############################################################
      def __init__(self,name,dflt_val,min_val,max_val):#(ref:src-np-init)
          self._dflt = dflt_val
          self._min = min_val
          self._max = max_val
          self.name = name
          self.reset()
      #############################################################
      ## @brief   restores the default value of the parameter
      #############################################################
      def reset(self): #(ref:src-np-reset)
          self.value = self._dflt
      #############################################################
      ## @brief   Determines if a new value is in the permited
      #           range
      #############################################################
      def validate(self, val):#(ref:src-np-validation)
          return (self._min <= val) & (val <= self._max)
      #############################################################
      ## @brief   Updates the stored value only if the new
      #           value is within range
      #############################################################
      def update(self,new_val):#(ref:src-np-update)
          if self.validate(new_val):
              self.value = new_val
      #############################################################
      ## @brief   Prints the parameter name and its value
      #############################################################
      def print_param(self):#(ref:src-np-print)
          print("%s = %f" % (self.name, self.value))
#+END_SRC

There is also a requirement to treat some numerical parameters as integers, therefore a specialization of the numerical parameters is shown in  [[src-config-int-param-class]], where some modifications and overloading are executed to provide with the desired properties.
- Values must be integers :: This class must have all its values as integers, thus the default values and other parameters are cast as integers.
- Validation Function :: Defined in line [[(src-ip-validation)]], this function also confirms that the parameter is an integer
- Print as integer :: The printing function defined in line  [[(src-ip-print)]], changes the format to ensure that the parameter is displayed as an integer and not as a float. This is a minor change, but desirable for consistency.

#+CAPTION: Integer parameters class definition
#+NAME: src-config-int-param-class
#+BEGIN_SRC python  -n -r
  #############################################################
  ## @class   Integer Parameter
  #  @brief   All functionality related to the numerical
  #           parameters that are to be treated as int
  #############################################################
  class integer_parameter(numerical_parameter):
      #############################################################
      ## @brief   Initilaization code
      #############################################################
      def __init__(self,name,dflt_val,min_val,max_val):
          _dflt = int(dflt_val)
          _min = int(min_val)
          _max = int(max_val)
          super(integer_parameter,self).__init__(name,_dflt,_min,_max)
      #############################################################
      ## @brief   Determines if a new int value is in the permited
      #           range, and integer
      #############################################################
      def validate(self, val): # (ref:src-ip-validation)
          is_valid = super(integer_parameter,self).validate(val)
          return  float(val).is_integer() & is_valid
      #############################################################
      ## @brief   Prints the parameter name and its value
      #############################################################
      def print_param(self): # (ref:src-ip-print)
          print("%s = %d" % (self.name, self.value))
#+END_SRC


****** Numerical Parameter Test                                    :noexport:
 Test the functionality of a generic numerical parameter. Just excecuted by using =C-c C-c=. Should all be true
 #+BEGIN_SRC python :tangle no
   import modules.ui_config as c
   tp = c.numerical_parameter("Test", 7.8, 0.5,50)
   t1 = tp.value == 7.8
   t2 = tp.validate(-1.1) == False
   tp.update(0.12)
   t3 = tp.value == 7.8
   tp.update(9)
   t4 = tp.value == 9
   t5 = tp.validate(88) == False
   tp.update(55)
   t6 = tp.value == 9
   tp.update(0.7)
   t7 = tp.value == 0.7
   tp.reset()
   t8 = tp.value == 7.8
   t9 = tp.name == "Test"
   return [t1,t2,t3,t4,t5,t6,t7,t8,t9]
 #+END_SRC

 #+RESULTS:
 | True | True | True | True | True | True | True | True | True |


***** TODO UI - Basic parameters
The basic parameters used to configure the measurement are parameters that are the most likely to be modified by the used, and whose side effects are better understood. These parameters usually deal with the speed and number of data points. 
In a more traditional object oriented paradigm, each parameter is controlled by its own class, which defines their default values, range, validation functions and how each parameter is updated.

The basic parameters are:
- Juncture Voltage :: This represents the voltage applied to the junture. See [[Juncture Voltage]]
- Piezo Speed Breaking :: This parameters defines the voltage rate which is applied to the piezoelectric, which has a direct impact on the juncture. See [[Piezo Speed Breaking]]
- Number of traces :: Traces are each process of opening and closing the juncture using the piezoelectric device. Each trace is a full cycle, and the number of traces represent the number of measurements to be taken. See [[Number of traces]]
- Data directory :: The results of the experiment are stored in a specific directory. See [[Data directory]]


#+BEGIN_SRC python
  class basic_params:
        def __init__(self):
              self.juncture = juncture_voltage()
              self.piezo_speed = piezo_speed()
              self.traces = traces()
              self.data_dir = data_dir()
        def restore_defaults(self):
              self.juncture.reset()
              self.piezo_speed.reset()
              self.traces.reset()
              self.data_dir.reset()
        def print_all(self):
              print("--- Basic Parameters ---")
              self.juncture.print_param()
              self.piezo_speed.print_param()
              self.traces.print_param()
              print("Directory = %s" % self.data_dir.path)
#+END_SRC

****** DONE Juncture Voltage
The juncture voltage defined in [[src-config-juncture-voltage-class]], as previously stated, is the parameter that controls the voltage applied to the juncture during the analysis. The juncture voltage class is just a specialization of the Numerical parameter class described in [[Numerical Parameters definition]]

#+CAPTION: Juncture voltage class definition
#+name: src-config-juncture-voltage-class
#+BEGIN_SRC python  -n -r
  #############################################################
  ## @class   juncture_voltage
  #  @brief   All functionality related to the juncture voltage
  #
  #  @details This class defines the behavior of the jucture
  #           voltage. Provides the default values and range
  #           plus the corresponding interface.
  #############################################################
  class juncture_voltage(numerical_parameter):
      #############################################################
      ## @brief   Initilaization code
      #############################################################
      def __init__(self):
          _dflt = 0.1 # (ref:src-jv-dflt)
          _min = 0.0  #(ref:src-jv-min)
          _max = 0.3  #(ref:src-jv-max)
          _name = "Juncture Voltage"
          super(juncture_voltage, self).__init__(_name,_dflt, _min, _max)
#+END_SRC

******* voltage test                                               :noexport:
Test functionality. Just excecuted by using =C-c C-c=. Should all be true
#+BEGIN_SRC python :tangle no
  import modules.ui_config as c
  jv = c.juncture_voltage()
  t1 = jv.value == 0.1
  t2 = jv.validate(1.1) == False
  jv.update(2)
  t3 = jv.value == 0.1
  jv.update(0.2)
  t4 = jv.value == 0.2
  t5 = jv.validate(-1.1) == False
  jv.update(5)
  t6 = jv.value == 0.2
  jv.update(0.22)
  t7 = jv.value == 0.22
  jv.reset()
  t8 = jv.value == 0.1
  t9 = jv.name == "Juncture Voltage"
  return [t1,t2,t3,t4,t5,t6,t7,t8,t9]
#+END_SRC

 #+RESULTS:
 | True | True | True | True | True | True | True | True | True |

****** DONE Piezo Speed Breaking
The piezo speed breaking defined in [[src-config-piezo-speed-class]] is the parameter that controls the speed at which each measurement cycle is executed, defined in \([V/s]\). The Piezo speed class is just a specialization of the Numerical parameter class described in [[Numerical Parameters definition]], with the additional fixed speed value.

#+CAPTION: Piezo speed breaking class definition
#+name: src-config-piezo-speed-class
#+BEGIN_SRC python -n -r
  #############################################################
  ## @class   piezo_speed
  #  @brief   All functionality related to the
  #           piezo_speed_breaking
  #
  #  @details This class defines the behavior of the piezo
  #           speed voltage relations which is defined in [V/s]
  #           Provides the default values and range plus the
  #           corresponding interfaces.
  #############################################################
  class piezo_speed(numerical_parameter):
      #############################################################
      ## @brief   Initilaization code
      #############################################################
      def __init__(self):
          _dflt = 300.0 #(ref:src-ps-dflt)
          _min = 30.0   #(ref:src-ps-min)
          _max = 300.0  #(ref:src-ps-max)
          _name = "Piezo Speed"
          super(piezo_speed, self).__init__(_name,_dflt, _min, _max)
          self.fixed_speed = _dflt
#+END_SRC
******* Piezo speed test                                           :noexport:
Test functionality. Just executed by using =C-c C-c=. Should all be true
#+BEGIN_SRC python :tangle no
  import modules.ui_config as c
  ps = c.piezo_speed()
  t1 = (ps.value == 300.0) & (ps.fixed_speed == 300.0)
  t2 = ps.validate(331.1) == False
  ps.update(334.2)
  t3 = (ps.value == 300.0) & (ps.fixed_speed == 300.0)
  ps.update(45.2)
  t4 = (ps.value == 45.2) & (ps.fixed_speed == 300.0)
  t5 = ps.validate(2.1) == False
  ps.update(700)
  t6 = (ps.value == 45.2) & (ps.fixed_speed == 300.0)
  ps.update(90)
  t7 = (ps.value == 90) & (ps.fixed_speed == 300.0)
  ps.reset()
  t8 = (ps.value == 300) & (ps.fixed_speed == 300.0)
  ps.update(-90)
  t9 = (ps.value == 300) & (ps.fixed_speed == 300.0)
  return [t1,t2,t3,t4,t5,t6,t7,t8,t9]
#+END_SRC

#+RESULTS:
| True | True | True | True | True | True | True | True | True |

