Measure_samples.org
****** DONE Number of traces
The number of traces defined in [[src-config-traces-class]] is the parameter that controls the number of measurement cycles excecuted using the piezoelectric actuator, where a trace is a full cycle going from closed to open and back. The traces class is a simple specialization of the Integer parameter class described in [[Numerical Parameters definition]] ([[src-config-int-param-class]]).

#+CAPTION: Number of traces class definition
#+NAME: src-config-traces-class
#+BEGIN_SRC python -n -r
  #############################################################
  ## @class   traces
  #  @brief   All functionality related to the number of traces
  #
  #  @details This class defines the parameter that controls
  #           the number of traces (runs) performed using the
  #           piezo. Each trace correspond to a full cycle
  #           from closed juncture to open and back.
  #############################################################
  class traces(integer_parameter):
        #############################################################
        ## @brief   Initilaization code
        #############################################################
        def __init__(self):
            _dflt = int(5000)  #(ref:src-tr-dflt)
            _min = int(1)      #(ref:src-tr-min)
            _max = int(20000)  #(ref:src-tr-max)
            _name = "Number of Traces"
            super(traces, self).__init__(_name,_dflt, _min, _max)
#+END_SRC
******* number traces test                                         :noexport:
#+BEGIN_SRC python :tangle no
  import modules.ui_config as c
  tr = c.traces()
  t1 = tr.value == 5000
  t2 = tr.validate(40000) == False
  tr.update(5.2)
  t3 = tr.value == 5000
  tr.update(200)
  t4 = tr.value == 200
  t5 = tr.validate(-100) == False
  tr.update(120000)
  t6 = tr.value == 200
  tr.update(8000)
  t7 = tr.value == 8000
  tr.reset()
  t8 = tr.value == 5000
  return [t1,t2,t3,t4,t5,t6,t7,t8]
#+END_SRC

#+RESULTS:
| True | True | True | True | True | True | True | True |

****** TODO Data directory
#+BEGIN_SRC python -n -r
  #############################################################
  ## @class   traces
  #  @brief   All functionality related to the data directory
  #
  #  @details This class defines the parameter that controls
  #           where the results will be stored. PENDING- TODO
  #############################################################
  class data_dir:
      _dflt = "./" #(ref:src-dd-dflt)
      _subdir_fmt= "data"
      #############################################################
      ## @brief   Initilaization code
      #############################################################
      def __init__(self):
          self.reset()
      ##############################################################
      ## @brief   restores the default value of the number of traces
      ##############################################################
      def reset(self): #(ref:src-dd-reset)
          self.path = self._dflt
      ## @brief   there is no need to validate?
      def validate(self, aux_val):#(ref:src-dd-validation)
          return True
      #############################################################
      ## @brief   Updates the piezo speed only if the new
      #           value is within range. Ensures it's an int
      #############################################################
      def update(self,new_path):#(ref:src-dd-update)
          if self.validate(new_path):
              self.path = new_path
#+END_SRC


#+NAME: ui-config-bp-interface
#+BEGIN_SRC python

#+END_SRC

***** TODO UI - Advanced parameters
#+BEGIN_SRC python
  class adv_params:
        def __init__(self):
              self.asdf = 1
#+END_SRC

#+NAME: ui-config-ap-interface
#+BEGIN_SRC python

#+END_SRC

#+name: ui-advanced-params-defaults
#+BEGIN_SRC python :exports none
piezo_start_V = 0.0         # V
high_G = 30.0              # G0
inter_G = 20.0              # G0
low_G = 10.0              # G0
piezo_speed_breaking1 = 300.0        # V/s
piezo_speed_breaking2 = 300.0        # V/s (30 to 300) Este es el que se puede cambiar
piezo_speed_making = 500.0        # V/s
#post_breaking_voltage = 230.0       #
post_breaking_voltage = 300.0       # cambia cuanto abro despues de que rompo
nGbins = 251
nDbins = 161
xmin = -0.5 # nm
xmax = 2    # nm
Gmin = 1e-7 # G0
Gmax = 10   # G0
#+END_SRC

***** TODO UI - Presentation
#+name: ui-presentation-params-defaults
#+BEGIN_SRC python :exports none
todoJUNCTURE_VOLTAGE_DFLT = 0  #[V]
todoPIEZO_SPEED_DFLT = 0       #[V/S]
todoDATA_DIRECTORY_DFTL = "./Data"
#+END_SRC

#+BEGIN_SRC python
  class presentation:
        def __init__(self):
              self.asdf = 1
#+END_SRC

#+NAME: ui-config-pp-interface
#+BEGIN_SRC python

#+END_SRC

*** TODO UI - GUI
   :PROPERTIES:
   :tangle:   modules/ui_gui.py
   :END:
# As with any module there is a section for the imports and the file headers, but these are unninteresting for any reader, thus they are put in comments and not exported to a PDF/HTML result
#+BEGIN_SRC python :exports none
  #################################################################
  ## @file    ui_gui.py
  #  @author  Joaquin Figueroa
  #  @date    Fri Aug 12 2016
  #  @brief   Provides the GUI for configuring the experiment
  #
  #  @details This file provides a GUI for the user to be able to
  #           configure the experiment and run it.
  #################################################################
  from PyQt4 import QtGui
  from PyQt4 import QtCore
  import ui_config as conf
  import sys
  <<ui-basic-params-defaults>>
  <<ui-advanced-params-defaults>>
  <<ui-presentation-params-defaults>>
#+END_SRC

The Graphical user interface consist of a window that allows the user to tweak with each of the parameters defined in [[UI - Program Interface]], plus buttons for deciding which action to take.

This program uses [[https://wiki.python.org/moin/PyQt][PyQt4]] as a GUI framework. To run a GUI, first is necessary to create an "application", then instantiate a widget, which corresponds to the specific UI that is being implemented to finally "execute" the "application". For a reference on how this is done under PyQt a tutorial can be found on [[http://zetcode.com/gui/pyqt4/]].

#+BEGIN_SRC python
  ############################################################
  ## @brief   Runs the GUI for the program
  ############################################################
  def run_gui():
      app = QtGui.QApplication(sys.argv) # Create "aplication"
      config_window = ui_config_window() # Instantiate widget
      app.exec_()                        # Execute appliaction
      return config_window.ui_config
#+END_SRC

**** TODO Configuration Window

The configuration window, shown in [[gui-config-window]] is a python widget which represents the user interface of the program. As usual with user interfaces they require an large amount of code only to initialize it where is difficult to separate the functionality. 

The standard procedure in python to build a widget is to delegate the initialization code to the parent class, and the UI elements specific to it, such as the buttons are defined in an internal initialization function of the class, commonly named =initUI= in line [[(fn-initUI)]]

The window object is composed of 3 basic elements:
- Config :: The contents of the window used to store and pass the configuration to the rest of the program shown in line [[(ui-config)]]
- Buttons ::  The UI has a button for each action including the measurements strategies to be used and to exit the program shown in line [[(ui-buttons)]]. For details see [[Buttons Layout]]
- Configuration :: The forms used to configure the parameters of the run defined in line [[(ui-config)]]. For details see [[Configuration Parameters Layout]]

Obviously as an object it also provides functionality to interact with it, mainly through the buttons of it, the idea is that only the window can modify it as to keep the interface as clean as possible.

The widget provides a callback defined in line [[(ui-close-cb)]] to be used by the buttons which will close the widget and ensure that the selected command, for example to measure, is executed
#+CAPTION: Definition of the configuration window
#+NAME: gui-config-window
#+BEGIN_SRC python -n -r
  ############################################################
  ## @class   ui_config_window
  #  @brief   Provides The UI window for the program
  #
  #  @details This Object provides the user interface to
  #           configure the measurements and which procedures
  #           to take.
  #           The object has the description of the window
  #           composed by the text dialogs and the buttons
  #           to run the simulation, which are stored as
  #           part of the window. The object also provides
  #           the functions to interface it.
  #           - initUI: Initialize the window
  ############################################################
  class ui_config_window(QtGui.QWidget):
      # Default constructor
      def __init__(self):
          super(ui_config_window, self).__init__()
          self.initUI()

      ############################################################
      ## @brief   Initializes the window
      #  @details Initialized the window components, which are the
      #           configs, the buttons and the configuration.
      #           Also ensures the layout of the UI elements
      ############################################################
      def initUI(self):    #(ref:fn-initUI)
          self.ui_config = conf.UI_CONFIG() #(ref:ui-config)

          buttons_layout = ui_create_buttons_layout(self) #(ref:ui-buttons)
          config_layout  = ui_create_config_layout(self)  #(ref:ui-config)
          vbox = QtGui.QVBoxLayout()
          vbox.addStretch(1)
          vbox.addLayout(config_layout)
          vbox.addLayout(buttons_layout)

          self.setLayout(vbox)
          self.setGeometry(300, 300, 300, 150)
          self.setWindowTitle('Buttons')
          self.show()

      ############################################################
      ## @brief   Interface to close the window and excecute a
      #           command
      ############################################################
      def close_with_cmd(self, cmd): #(ref:ui-close-cb)
          self.ui_config.update_cmd(cmd)
          QtCore.QCoreApplication.instance().quit()
#+END_SRC
**** TODO Buttons Layout
The buttons provide the functionality to launch the different process of the tool. Therefore clicking a button will close the UI and excecute the action stated on it. Also a small tooltip is provided in case the user requires additional information.

To define a button, first it must be created using the text to be displayed, then the attributes associated to it, meaning the action it will perform and the tooltip displayed, if any.
A special mention is made for the callback used in each button as it uses anonymous functions as shown in line [[(lambda_btn)]] to call the function that excecutes the corresponding action. While a more advanced programming technique (see [[https://en.wikipedia.org/wiki/Anonymous_function]]) it provides the cleanest and easiest method to provide this functionality (See also [[http://stackoverflow.com/questions/15080731/call-a-function-when-a-button-is-pressed-pyqt]])

Finally the buttons created are added to the layout of the button section of the window which is returned to the user.
#+BEGIN_SRC python -r -n
  ############################################################
  ## @brief   Creates buttons layout and returns it
  #
  #  @details The function creates a layout to place the
  #           buttons to perform the different actions of the
  #           program.
  #           The layout creates the following buttons:
  #           - Quit Button: Ends the program
  #           - Break Button: Use the motor do break junction
  #           - Measure Button: Do a break junction and then
  #                             use the piezo to measure
  ############################################################
  def ui_create_buttons_layout(widget):
      # Quit Button
      quit_button = QtGui.QPushButton("Quit")
      quit_button.clicked.connect(
          lambda: widget.close_with_cmd(conf.UI_CMD.EXIT)) (ref:lambda_btn)
      quit_button.setToolTip("Terminates the program")
      # Break Button
      break_button = QtGui.QPushButton("Only break")
      break_button.clicked.connect(
          lambda: widget.close_with_cmd(conf.UI_CMD.M_BREAK))
      break_button.setToolTip("Use the motor to create a break junction.")
      # Measure Button
      measure_button = QtGui.QPushButton("Full Measure")
      measure_button.clicked.connect(
          lambda: widget.close_with_cmd(conf.UI_CMD.MEASURE))
      measure_button.setToolTip(
          "Performs measurement using the motor and piezo")

      # Build Layout
      hbox = QtGui.QHBoxLayout()
      hbox.addStretch(1)
      hbox.addWidget(quit_button)
      hbox.addWidget(break_button)
      hbox.addWidget(measure_button)

      vbox = QtGui.QVBoxLayout()
      vbox.addStretch(1)
      vbox.addLayout(hbox)
      return vbox
#+END_SRC

**** TODO Configuration Parameters Layout
Since the configuration parameters are split in different groups so it is the layout of the configuration window, leaving a vertical section of the window to each group. The top level of the configuration parameters layout is shown in [[config-param-layout]], using the same techniques already used for the buttons. The rest of the description of the configuration parameters GUI is described in different sections:

- Basic parameters :: The layout for the basic parameters is described in [[Basic parameters layout]]
- Advanced parameters :: The layout for the advanced parameters is described in [[Advanced parameters layout]]
- Presentation parameters :: The layout for the presentation parameters is described in [[Presentation parameters layout]]
- Utilities :: Some utilities shared by all the different layouts are described in [[Configuration parameters layout utilities]]

#+CAPTION: Configuration parameters layout
#+NAME: config-param-layout
#+BEGIN_SRC python
  ############################################################
  ## @brief   Describes the configuration parameters layout
  #
  #  @details This function provides the layout for the portion
  #           of the window that allows the user to configure
  #           the parameters for the run.
  #           The layout is split in 3 vertical sections one
  #           with each parameter group.
  #           Each group is preceded by a small label
  #           identifying the group
  ############################################################
  def ui_create_config_layout(ui_config_window):
      # Define each group layout
      basic_param_layout = ui_basic_param_layout(ui_config_window)
      adv_param_layout = ui_adv_param_layout(ui_config_window)
      presentation_param_layout = ui_presentation_param_layout(ui_config_window)
      # Define the labels
      basic_label = QtGui.QLabel("---- Basic Parameters ----")
      adv_label = QtGui.QLabel("---- Advanced Parameters ----")
      presentation_label = QtGui.QLabel("---- Presentation Parameters ----")
      # Configure the layout
      vbox = QtGui.QVBoxLayout()
      vbox.addStretch(1)
      vbox.addWidget(basic_label)
      vbox.addLayout(basic_param_layout)
      vbox.addWidget(adv_label)
      vbox.addLayout(adv_param_layout)
      vbox.addWidget(presentation_label)
      vbox.addLayout(presentation_param_layout)
      return vbox
#+END_SRC

